openfoam/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-15 -15 0)
    ( 60 -15 0)
    ( 60  15 0)
    (-15  15 0)

    (-15 -15 15)
    ( 60 -15 15)
    ( 60  15 15)
    (-15  15 15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 60 40) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }
    outlet
    {
        type patch;
        faces ((1 5 6 2));
    }
    sides
    {
        type patch;
        faces ((0 4 5 1) (3 2 6 7));
    }
    top
    {
        type patch;
        faces ((4 7 6 5));
    }
    ground
    {
        type wall;
        faces ((0 1 2 3));
    }
);

mergePatchPairs ();
