openfoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(p)         Gauss linear;
    grad(k)         Gauss linear;
    grad(omega)     Gauss linear;
}

divSchemes
{
    default                         none;

    // Momentum convection: 2nd order but bounded
    div(phi,U)                      bounded Gauss linearUpwindV grad(U);

    // Turbulence convection: make it strongly bounded (helps stop k<0)
    div(phi,k)                      bounded Gauss upwind;
    div(phi,omega)                  bounded Gauss upwind;

    // If you ever switch to epsilon model
    div(phi,epsilon)                bounded Gauss upwind;

    // Diffusion / stress terms
    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
    div(nonlinearStress)            Gauss linear;
}

laplacianSchemes
{
    // corrected is fine for general meshes; if you still see oscillations,
    // change to "Gauss linear limited 0.5"
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //

